Revit 2024 API
BuiltInFailures.FabricFailures.FabricAreaWrongHost Property
 Fabric Area can be placed only in Structural Floors and straight Structural Walls.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId FabricAreaWrongHost { get; }
Visual Basic
Public Shared ReadOnly Property FabricAreaWrongHost As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ FabricAreaWrongHost {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.FabricFailures Class
Autodesk.Revit.DB Namespace